; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob44) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate0)
	(at pallet1 depot1)
	(clear crate7)
	(at pallet2 depot2)
	(clear crate5)
	(at pallet3 distributor0)
	(clear crate6)
	(at pallet4 distributor1)
	(clear crate1)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 distributor1)
	(clear pallet6)
	(at truck0 distributor2)
	(at truck1 depot2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor2)
	(available hoist6)
	(at hoist7 distributor2)
	(available hoist7)
	(at hoist8 depot2)
	(available hoist8)
	(at hoist9 depot1)
	(available hoist9)
	(at hoist10 distributor0)
	(available hoist10)
	(at hoist11 depot1)
	(available hoist11)
	(at hoist12 depot0)
	(available hoist12)
	(at crate0 depot0)
	(on crate0 pallet0)
	(at crate1 distributor1)
	(on crate1 pallet4)
	(at crate2 distributor0)
	(on crate2 pallet3)
	(at crate3 distributor0)
	(on crate3 crate2)
	(at crate4 distributor0)
	(on crate4 crate3)
	(at crate5 depot2)
	(on crate5 pallet2)
	(at crate6 distributor0)
	(on crate6 crate4)
	(at crate7 depot1)
	(on crate7 pallet1)
)

(:goal (and
		(on crate0 pallet3)
		(on crate1 pallet0)
		(on crate2 pallet5)
		(on crate3 pallet2)
		(on crate5 crate6)
		(on crate6 pallet1)
		(on crate7 pallet4)
	)
))

; plan
1. (lift hoist12 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist12) (on crate0 pallet0)
   added: (lifting hoist12 crate0) (clear pallet0)
   goals met: 0 of 7
2. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 0 of 7
3. (load hoist12 crate0 truck0 depot0)
   deleted: (lifting hoist12 crate0)
   added: (in crate0 truck0) (available hoist12)
   goals met: 0 of 7
4. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 0 of 7
5. (unload hoist3 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist3)
   added: (lifting hoist3 crate0)
   goals met: 0 of 7
6. (lift hoist8 crate5 pallet2 depot2)
   deleted: (at crate5 depot2) (clear crate5) (available hoist8) (on crate5 pallet2)
   added: (lifting hoist8 crate5) (clear pallet2)
   goals met: 0 of 7
7. (load hoist8 crate5 truck1 depot2)
   deleted: (lifting hoist8 crate5)
   added: (in crate5 truck1) (available hoist8)
   goals met: 0 of 7
8. (drive truck1 depot2 distributor0)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor0)
   goals met: 0 of 7
9. (lift hoist9 crate7 pallet1 depot1)
   deleted: (at crate7 depot1) (clear crate7) (available hoist9) (on crate7 pallet1)
   added: (lifting hoist9 crate7) (clear pallet1)
   goals met: 0 of 7
10. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 0 of 7
11. (load hoist9 crate7 truck0 depot1)
   deleted: (lifting hoist9 crate7)
   added: (in crate7 truck0) (available hoist9)
   goals met: 0 of 7
12. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   goals met: 0 of 7
13. (lift hoist4 crate1 pallet4 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist4) (on crate1 pallet4)
   added: (lifting hoist4 crate1) (clear pallet4)
   goals met: 0 of 7
14. (load hoist4 crate1 truck0 distributor1)
   deleted: (lifting hoist4 crate1)
   added: (in crate1 truck0) (available hoist4)
   goals met: 0 of 7
15. (unload hoist4 crate7 truck0 distributor1)
   deleted: (in crate7 truck0) (available hoist4)
   added: (lifting hoist4 crate7)
   goals met: 0 of 7
16. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 0 of 7
17. (unload hoist12 crate1 truck0 depot0)
   deleted: (in crate1 truck0) (available hoist12)
   added: (lifting hoist12 crate1)
   goals met: 0 of 7
18. (drop hoist4 crate7 pallet4 distributor1)
   deleted: (lifting hoist4 crate7) (clear pallet4)
   added: (available hoist4) (at crate7 distributor1) (clear crate7) (on crate7 pallet4)
   goals met: 1 of 7
19. (drop hoist12 crate1 pallet0 depot0)
   deleted: (lifting hoist12 crate1) (clear pallet0)
   added: (available hoist12) (at crate1 depot0) (clear crate1) (on crate1 pallet0)
   goals met: 2 of 7
20. (lift hoist10 crate6 crate4 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist10) (on crate6 crate4)
   added: (lifting hoist10 crate6) (clear crate4)
   goals met: 2 of 7
21. (load hoist3 crate0 truck1 distributor0)
   deleted: (lifting hoist3 crate0)
   added: (in crate0 truck1) (available hoist3)
   goals met: 2 of 7
22. (load hoist10 crate6 truck1 distributor0)
   deleted: (lifting hoist10 crate6)
   added: (in crate6 truck1) (available hoist10)
   goals met: 2 of 7
23. (lift hoist10 crate4 crate3 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist10) (on crate4 crate3)
   added: (lifting hoist10 crate4) (clear crate3)
   goals met: 2 of 7
24. (drive truck1 distributor0 depot1)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot1)
   goals met: 2 of 7
25. (unload hoist9 crate5 truck1 depot1)
   deleted: (in crate5 truck1) (available hoist9)
   added: (lifting hoist9 crate5)
   goals met: 2 of 7
26. (unload hoist11 crate6 truck1 depot1)
   deleted: (in crate6 truck1) (available hoist11)
   added: (lifting hoist11 crate6)
   goals met: 2 of 7
27. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   goals met: 2 of 7
28. (drop hoist11 crate6 pallet1 depot1)
   deleted: (lifting hoist11 crate6) (clear pallet1)
   added: (available hoist11) (at crate6 depot1) (clear crate6) (on crate6 pallet1)
   goals met: 3 of 7
29. (drop hoist9 crate5 crate6 depot1)
   deleted: (lifting hoist9 crate5) (clear crate6)
   added: (available hoist9) (at crate5 depot1) (clear crate5) (on crate5 crate6)
   goals met: 4 of 7
30. (lift hoist3 crate3 crate2 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist3) (on crate3 crate2)
   added: (lifting hoist3 crate3) (clear crate2)
   goals met: 4 of 7
31. (load hoist3 crate3 truck1 distributor0)
   deleted: (lifting hoist3 crate3)
   added: (in crate3 truck1) (available hoist3)
   goals met: 4 of 7
32. (lift hoist3 crate2 pallet3 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist3) (on crate2 pallet3)
   added: (lifting hoist3 crate2) (clear pallet3)
   goals met: 4 of 7
33. (load hoist3 crate2 truck1 distributor0)
   deleted: (lifting hoist3 crate2)
   added: (in crate2 truck1) (available hoist3)
   goals met: 4 of 7
34. (unload hoist3 crate0 truck1 distributor0)
   deleted: (in crate0 truck1) (available hoist3)
   added: (lifting hoist3 crate0)
   goals met: 4 of 7
35. (drive truck1 distributor0 depot2)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot2)
   goals met: 4 of 7
36. (unload hoist8 crate3 truck1 depot2)
   deleted: (in crate3 truck1) (available hoist8)
   added: (lifting hoist8 crate3)
   goals met: 4 of 7
37. (drive truck1 depot2 distributor2)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor2)
   goals met: 4 of 7
38. (unload hoist7 crate2 truck1 distributor2)
   deleted: (in crate2 truck1) (available hoist7)
   added: (lifting hoist7 crate2)
   goals met: 4 of 7
39. (drop hoist8 crate3 pallet2 depot2)
   deleted: (lifting hoist8 crate3) (clear pallet2)
   added: (available hoist8) (at crate3 depot2) (clear crate3) (on crate3 pallet2)
   goals met: 5 of 7
40. (drop hoist3 crate0 pallet3 distributor0)
   deleted: (lifting hoist3 crate0) (clear pallet3)
   added: (available hoist3) (at crate0 distributor0) (clear crate0) (on crate0 pallet3)
   goals met: 6 of 7
41. (drop hoist7 crate2 pallet5 distributor2)
   deleted: (lifting hoist7 crate2) (clear pallet5)
   added: (available hoist7) (at crate2 distributor2) (clear crate2) (on crate2 pallet5)
   goals met: 7 of 7
